content/man/man1/flatpak-info.1.org
#+TITLE: Manpages - flatpak-info.1
* NAME
flatpak-info - Show information about an installed application or
runtime

* SYNOPSIS
*flatpak info* [OPTION...] NAME [BRANCH]

* DESCRIPTION
Show info about an installed application or runtime.

By default, the output is formatted in a friendly format. If you specify
any of the *--show-...* or *--file-access* options, the output is
instead formatted in a machine-readable format.

By default, both per-user and system-wide installations are queried. Use
the *--user*, *--system* or *--installation* options to change this.

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*-u*, *--user*

#+begin_quote
Query per-user installations.

#+end_quote

*--system*

#+begin_quote
Query the default system-wide installation.

#+end_quote

*--installation=NAME*

#+begin_quote
Query a system-wide installation by NAME among those defined in
/etc/flatpak/installations.d/. Using *--installation=default* is
equivalent to using *--system*.

#+end_quote

*--arch=ARCH*

#+begin_quote
Query for this architecture. See *flatpak --supported-arches* for
architectures supported by the host.

#+end_quote

*-r*, *--show-ref*

#+begin_quote
Show the installed ref.

#+end_quote

*-o*, *--show-origin*

#+begin_quote
Show the remote the ref is installed from.

#+end_quote

*-c*, *--show-commit*

#+begin_quote
Show the installed commit id.

#+end_quote

*-s*, *--show-size*

#+begin_quote
Show the installed size.

#+end_quote

*-m*, *--show-metadata*

#+begin_quote
Show the metadata.

#+end_quote

*--show-runtime*

#+begin_quote
Show the runtime.

#+end_quote

*--show-sdk*

#+begin_quote
Show the SDK.

#+end_quote

*-M*, *--show-permissions*

#+begin_quote
Show the permissions.

#+end_quote

*--file-access=PATH*

#+begin_quote
Show the level of access to the given path.

#+end_quote

*-e*, *--show-extensions*

#+begin_quote
Show the matching extensions.

#+end_quote

*-l*, *--show-location*

#+begin_quote
Show the on-disk location of the app or runtime. See the examples below.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

* EXAMPLES
*$ flatpak info org.gnome.Builder//master*

*$ tree `flatpak info -l org.gnome.Builder//master`/files*

* SEE ALSO
*flatpak*(1), *flatpak-install*(1), *flatpak-update*(1)
