public/man/man1/flatpak-info.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-info.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-info.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-info - Show information about an installed application or
runtime</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak info</strong> [OPTION…] NAME [BRANCH]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Show info about an installed application or runtime.</p>
<p>
By default, the output is formatted in a friendly format. If you specify
any of the <strong>–show-…</strong> or <strong>–file-access</strong> options, the output is
instead formatted in a machine-readable format.</p>
<p>
By default, both per-user and system-wide installations are queried. Use
the <strong>–user</strong>, <strong>–system</strong> or <strong>–installation</strong> options to change this.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Query per-user installations.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Query the default system-wide installation.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Query a system-wide installation by NAME among those defined in
<em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–arch=ARCH</strong></p>
<blockquote>
<p>Query for this architecture. See <strong>flatpak –supported-arches</strong> for
architectures supported by the host.</p>
</blockquote>
<p>
<strong>-r</strong>, <strong>–show-ref</strong></p>
<blockquote>
<p>Show the installed ref.</p>
</blockquote>
<p>
<strong>-o</strong>, <strong>–show-origin</strong></p>
<blockquote>
<p>Show the remote the ref is installed from.</p>
</blockquote>
<p>
<strong>-c</strong>, <strong>–show-commit</strong></p>
<blockquote>
<p>Show the installed commit id.</p>
</blockquote>
<p>
<strong>-s</strong>, <strong>–show-size</strong></p>
<blockquote>
<p>Show the installed size.</p>
</blockquote>
<p>
<strong>-m</strong>, <strong>–show-metadata</strong></p>
<blockquote>
<p>Show the metadata.</p>
</blockquote>
<p>
<strong>–show-runtime</strong></p>
<blockquote>
<p>Show the runtime.</p>
</blockquote>
<p>
<strong>–show-sdk</strong></p>
<blockquote>
<p>Show the SDK.</p>
</blockquote>
<p>
<strong>-M</strong>, <strong>–show-permissions</strong></p>
<blockquote>
<p>Show the permissions.</p>
</blockquote>
<p>
<strong>–file-access=PATH</strong></p>
<blockquote>
<p>Show the level of access to the given path.</p>
</blockquote>
<p>
<strong>-e</strong>, <strong>–show-extensions</strong></p>
<blockquote>
<p>Show the matching extensions.</p>
</blockquote>
<p>
<strong>-l</strong>, <strong>–show-location</strong></p>
<blockquote>
<p>Show the on-disk location of the app or runtime. See the examples below.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p><strong>$ flatpak info org.gnome.Builder//master</strong></p>
<p>
<strong>$ tree `flatpak info -l org.gnome.Builder//master`/files</strong></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *flatpak-install*(1), *flatpak-update*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
